
from random import randint

print("*******************************************")
print("************** Знайди привида *************")
print("*******************************************")
print()
print("*******************************************")
print("*****За одними з трьох дверей є привид*****")
print("*******************************************")
print()
print("*******************************************")
print("Вводи номер дверей, поки не знайдеш привида")
print("*******************************************")

score = 0

while True:
    ghost_door = randint(1,3)
    door_choosen = int(input("\n\nЯкі двері 1 чи 2 чи 3? "))
    
    if ghost_door == door_choosen:
        print("\nПривид! Привид!! Привид!!!")
        break
    else:
        print("+5 балів:)")
        score += 5
    
print("\nТвої бали =", score)
print("\n\n********** Кінець гри **********")


